train_SM/generate_data_3d/original_snappy/system/blockMeshDict_plate
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                |                                                  |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox            |
|  \    /   O peration     | Version:  5                                      |
|   \  /    A nd           | Web:      www.OpenFOAM.org                       |
|    \/     M anipulation  |                                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (15 -1 0.05)
    (0 -0.2375195293697055 0.05)
    (3.907347567932657 -0.2375195293697055 0.05)
    (3.994171656766122 0.2548843471363985 0.05)
    (0 0.2548843471363985 0.05)
    (0 1 0.05)
    (3.994171656766122 1 0.05)
    (15 1 0.05)
    (15 0.2548843471363985 0.05)
    (15 0.2375195293697055 0.05)
    (4.092652432067343 0.2375195293697055 0.05)
    (0 -0.2548843471363985 0.05)
    (4.005828343233878 -0.2548843471363985 0.05)
    (0 -1 0.05)
    (4.005828343233878 -1 0.05)
    (15 -0.2548843471363985 0.05)
    (15 -1 -0.05)
    (0 -0.2375195293697055 -0.05)
    (3.907347567932657 -0.2375195293697055 -0.05)
    (3.994171656766122 0.2548843471363985 -0.05)
    (0 0.2548843471363985 -0.05)
    (0 1 -0.05)
    (3.994171656766122 1 -0.05)
    (15 1 -0.05)
    (15 0.2548843471363985 -0.05)
    (15 0.2375195293697055 -0.05)
    (4.092652432067343 0.2375195293697055 -0.05)
    (0 -0.2548843471363985 -0.05)
    (4.005828343233878 -0.2548843471363985 -0.05)
    (0 -1 -0.05)
    (4.005828343233878 -1 -0.05)
    (15 -0.2548843471363985 -0.05)
);

blocks
(
    hex (17 18 19 20 1 2 3 4) (159 59 1) simpleGrading (0.3333333333333333 1 1)
    hex (20 19 22 21 4 3 6 5) (159 59 1) simpleGrading (0.3333333333333333 ( (0.5 0.5 3.0) (0.5 0.5 0.3333333333333333) ) 1)
    hex (19 24 23 22 3 8 7 6) (440 59 1) simpleGrading (3.0 ( (0.5 0.5 3.0) (0.5 0.5 0.3333333333333333) ) 1)
    hex (26 25 24 19 10 9 8 3) (440 2 1) simpleGrading (3.0 1 1)
    hex (27 28 18 17 11 12 2 1) (159 2 1) simpleGrading (0.3333333333333333 1 1)
    hex (29 30 28 27 13 14 12 11) (159 59 1) simpleGrading (0.3333333333333333 ( (0.5 0.5 3.0) (0.5 0.5 0.3333333333333333) ) 1)
    hex  (30 16 31 28 14 0 15 12) (440 59 1) simpleGrading (3.0 ( (0.5 0.5 3.0) (0.5 0.5 0.3333333333333333) ) 1)
    hex (28 31 25 26 12 15 9 10) (440 59 1) simpleGrading (3.0 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (20 4 5 21)
            (17 1 4 20)
            (27 11 1 17)
            (29 13 11 27)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7 8 24 23)
            (8 9 25 24)
            (9 15 31 25)
            (15 0 16 31)
        );
    }
    top
    {
        type wall;
        faces
        (
            (21 5 6 22)
            (22 6 7 23)
            (13 29 30 14)
            (14 30 16 0)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (3 19 26 10)
            (10 26 28 12)
            (18 2 12 28)
            (19 3 2 18)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
